      *****************************************************************
      * Author: Daniel
      * Date: 18/02
      * Purpose: print hello world
      * Tectonics: cobc
      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Hello.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Hello world"
           STOP RUN.
