//KC02999A  JOB 'FATEC','ANESIO',CLASS=A,
//        MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=WRIKSDS
//STEPLIB  DD DSN=KC02999.AULA.LOAD,DISP=SHR
//CLI      DD DSN=KC02999.VSAM.KSDSFILE.CLUSTER,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
001002346
Manuel de Almeida
010367900
YES
001209856
Joao da Silva
001298200
YES
001211834
Alfredo das Neves
000845000
YES
012300427
Maria Aparecida
045280000
NO
/*