//KC03EC4C JOB (FATEC),'DANIEL',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1 EXEC IGYWCL,PARM.COBOL='LIB,APOST,XREF,MAP,OFFSET'                    
//COBOL.SYSIN DD DISP=SHR,DSN=KC03EC4.AULA.COBLIB(CADCLI1)          
//LKED.SYSLMOD DD DISP=SHR,DSN=KC03EC4.AULA.LOAD(CADCLI1)          
//SYSPRINT DD SYSOUT=*                                             
/*                      