//KC03EC4C   JOB 'FATEC','DANIEL',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1      EXEC PGM=CADCLI1  
//STEPLIB    DD DISP=SHR,DSN=KC03EC4.AULA.LOAD  
//CADC       DD DISP=SHR,DSN=KC03EC4.AULA.CLIENTE 
//SYSPRINT   DD SYSOUT=*  
//SYSIN      DD *
012
300427
/* 