//KKC03EC4C JOB (FATEC),'DANIEL',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID  
//STEP1 EXEC PGM=HELLO1
//STEPLIB DD DISP=SHR,DSN=KC03EC4.AULA.LOAD                 
//SYSPRINT DD SYSOUT=* 
/*                                                                 